In [2]:
import pandas as pd
employee_data_df=pd.read_csv('employee_data.csv')

#### Then convert and export the data to use the following format instead:

Emp ID,First Name,Last Name,DOB,SSN,State
214,Sarah,Simpson,12/04/1985,***-**-8166,FL
15,Samantha,Lara,09/08/1993,***-**-7526,CO
411,Stacy,Charles,12/20/1957,***-**-8526,PA

#### In summary, the required conversions are as follows:

The Name column should be split into separate First Name and Last Name columns.
The DOB data should be re-written into MM/DD/YYYY format.
The SSN data should be re-written such that the first five numbers are hidden from view.
The State data should be re-written as simple two-letter abbreviations.

In [3]:
employee_data_df.head(2)

   Emp ID          Name         DOB          SSN         State
0     232  John Mathews  1991-02-24  289-31-9165  North Dakota
1     533  Nathan Moore  1978-11-19  220-05-7469         Maine

In [4]:
employee_data_df.shape

(650, 5)

In [5]:
# Split the column for Name into First Name and last Name
employee_data_df['First Name'] = employee_data_df['Name'].apply(lambda x: x.split(" ")[0])
employee_data_df['Last Name'] =  employee_data_df['Name'].apply(lambda x: x.split(" ")[1])

In [6]:
employee_data_df.head(2)

,Emp ID,Name,DOB,SSN,State,First Name,Last Name
0,232,John Mathews,1991-02-24,289-31-9165,North Dakota,John,Mathews
1,533,Nathan Moore,1978-11-19,220-05-7469,Maine,Nathan,Moore

In [7]:
employee_data_df = employee_data_df[['Emp ID', 'First Name', 'Last Name', 'DOB', 'SSN', 'State']]

In [8]:
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  1991-02-24  289-31-9165  North Dakota
1     533     Nathan     Moore  1978-11-19  220-05-7469         Maine

In [9]:
employee_data_df['DOB'] = pd.to_datetime(employee_data_df['DOB'])

employee_data_df['DOB'] = employee_data_df['DOB'].dt.strftime('%m/%d/%Y')

In [10]:
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  02/24/1991  289-31-9165  North Dakota
1     533     Nathan     Moore  11/19/1978  220-05-7469         Maine

In [16]:
employee_data_df['SSN'] = employee_data_df['SSN'].apply(lambda x: "***-**-" + x[7:])

In [17]:
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  02/24/1991  ***-**-9165  North Dakota
1     533     Nathan     Moore  11/19/1978  ***-**-7469         Maine

In [19]:
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [20]:
employee_data_df['State']= employee_data_df['State'].apply(lambda x: us_state_abbrev[x])

In [21]:
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN State
0     232       John   Mathews  02/24/1991  ***-**-9165    ND
1     533     Nathan     Moore  11/19/1978  ***-**-7469    ME

In [ ]:
df.to_csv(employee_data2.csv,inplace=True)